Tekla Open API Reference for Tekla Structures 2025
DistanceList Constructor
 Initializes a new instance of the structure.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DistanceList(
	IEnumerable<Distance> distanceList
)
Public Sub New (
	distanceList As IEnumerable(Of Distance)
)
Parameters
distanceList
Type: System.Collections.Generic.IEnumerable<Distance>
The distance list.
Examples
 This example shows how to construct an empty DistanceList instance as well as a DistanceList instance from an existing enumerable collection of Distance instances. A copy of the collection is created, modifying the original collection does not affect the constructed DistanceList.
using Tekla.Structures.Datatype;
public class Example
{
       public void Example1()
       {
           // By default the constructor creates an empty list.
           DistanceList defaultList = new DistanceList();
           // Distance list can also be constructed from an array (or any other
           // enumerable collection) of Distance instances.
           Distance[] distances = { new Distance(30.2), new Distance(2.3) };
           // Distance lists created this way contain a copy of the source collection.
           // Modifying the original collection does not affect the constructed list.
           DistanceList distanceList = new DistanceList(distances);
           distanceList = defaultList;
       }
}
See Also
Reference
DistanceList Structure
Tekla.Structures.Datatype Namespace